## Column Transformer

In [50]:
import numpy as np
import pandas as pd

from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder

from sklearn.preprocessing import OrdinalEncoder

In [52]:
df = pd.read_csv("C:\\Users\\hardi\\OneDrive - wipro\\Desktop\\datasets\\covid_toy - covid_toy.csv")

In [54]:
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [56]:
df.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

In [58]:
from sklearn.model_selection import train_test_split

x_train , x_test , y_train , y_test = train_test_split(df.drop(columns = ['has_covid']) , 
                                                       df['has_covid'] , test_size = 0.2)

In [60]:
x_train

    age  gender  fever   cough       city
7    20  Female    NaN  Strong     Mumbai
57   49  Female   99.0  Strong  Bangalore
75    5    Male  102.0    Mild    Kolkata
85   16  Female  103.0    Mild  Bangalore
49   44    Male  104.0    Mild     Mumbai
..  ...     ...    ...     ...        ...
74   34  Female  104.0  Strong      Delhi
26   19  Female  100.0    Mild    Kolkata
6    14    Male  101.0  Strong  Bangalore
94   79    Male    NaN  Strong    Kolkata
87   47    Male  101.0  Strong  Bangalore

[80 rows x 5 columns]

## Manually type output

In [63]:
# adding simple imputer to fever column

si = SimpleImputer(strategy = "mean")
x_train_fever = si.fit_transform(x_train[['fever']])

# also the test data

x_test_fever = si.fit_transform(x_test[['fever']])

x_train_fever.shape

(80, 1)

In [65]:
# ordinal encoding 

oe = OrdinalEncoder (categories = [['Mild' , 'Strong']])
x_train_cough = oe.fit_transform(x_train[['cough']])

# aslo the test data

x_test_cough = oe.fit_transform(x_test[['cough']])

x_train_cough.shape

(80, 1)

In [67]:
# onehotencoding ---> gender , city

ohe = OneHotEncoder(drop = 'first' , sparse_output = False)
x_train_gender_city = ohe.fit_transform(x_train[['gender' , 'city']])

# also the test data

x_test_gender_city = ohe.fit_transform(x_test[['gender' , 'city']])
x_test_gender_city.shape

(20, 4)

In [69]:
# Extracting age

x_train_age = x_train.drop(columns = ['gender' , 'fever' , 'cough' , 'city']).values

# also the test data

x_test_age = x_test.drop(columns = ['gender' , 'fever' , 'cough' , 'city']).values

In [71]:
x_train_age.shape

(80, 1)

In [73]:
x_train_transformed = np.concatenate((x_train_age , x_train_fever,
                                     x_train_gender_city,
                                     x_train_cough) , axis = 1)

In [75]:
x_test_transformed = np.concatenate((x_test_age , x_test_fever,
                                     x_test_gender_city,
                                     x_test_cough) , axis = 1)

In [77]:
x_train_transformed.shape

(80, 7)

## By the help of column Transformer

In [80]:
from sklearn.compose import ColumnTransformer     # this is how to import columntransformer

transformer  = ColumnTransformer (transformers = [
    ('tnf1' , SimpleImputer() , ['fever']), 
    
    # in a 'fever' column by the help of si we fill missing vales by mean,median,mode.
    ('tnf2' , OrdinalEncoder(categories= [['Mild' , 'Strong']]) , ['cough']), #by this process we encode ourr data.
    ('tnf3' , OneHotEncoder(sparse_output = False , drop = 'first') , ['gender' , 'city'])
],remainder = 'passthrough')  ## remainder = passthrough ==> it means rest all the columns remains same.

In [87]:
transformer.fit_transform(x_train).shape

(80, 7)

In [91]:
transformer.transform(x_train).shape

(80, 7)

## Apply get_dummies and onehotencoding

In [126]:
import numpy as np
import pandas as pd

In [128]:
df = pd.read_csv("C:\\Users\\hardi\\OneDrive - wipro\\Desktop\\datasets\\tips - tips.csv")

In [130]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [132]:
df = df.drop(columns = ['total_bill' , 'tip' , 'size'])

In [134]:
df.isnull().sum()

sex       0
smoker    0
day       0
time      0
dtype: int64

In [136]:
df

        sex smoker   day    time
0    Female     No   Sun  Dinner
1      Male     No   Sun  Dinner
2      Male     No   Sun  Dinner
3      Male     No   Sun  Dinner
4    Female     No   Sun  Dinner
..      ...    ...   ...     ...
239    Male     No   Sat  Dinner
240  Female    Yes   Sat  Dinner
241    Male    Yes   Sat  Dinner
242    Male     No   Sat  Dinner
243  Female     No  Thur  Dinner

[244 rows x 4 columns]

In [138]:
df.shape

(244, 4)

In [140]:
from sklearn.preprocessing import OneHotEncoder

In [142]:
ohe = OneHotEncoder()

In [144]:
ohe = OneHotEncoder(drop = 'first' , sparse_output = False , dtype = np.int32)

In [146]:
df_new = ohe.fit_transform(df[['sex' , 'smoker' , 'day' , 'time']])

In [148]:
df_new

array([[0, 0, 0, 1, 0, 0],
       [1, 0, 0, 1, 0, 0],
       [1, 0, 0, 1, 0, 0],
       ...,
       [1, 1, 1, 0, 0, 0],
       [1, 0, 1, 0, 0, 0],
       [0, 0, 0, 0, 1, 0]])

In [151]:
df.head()

      sex smoker  day    time
0  Female     No  Sun  Dinner
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

## get_dummies

In [154]:
df_new = pd.get_dummies(df , drop_first = True , columns = ['sex' , 'smoker' , 'day' , 'time'] )

In [156]:
df_new.astype(int)

     sex_Male  smoker_Yes  day_Sat  day_Sun  day_Thur  time_Lunch
0           0           0        0        1         0           0
1           1           0        0        1         0           0
2           1           0        0        1         0           0
3           1           0        0        1         0           0
4           0           0        0        1         0           0
..        ...         ...      ...      ...       ...         ...
239         1           0        1        0         0           0
240         0           1        1        0         0           0
241         1           1        1        0         0           0
242         1           0        1        0         0           0
243         0           0        0        0         1           0

[244 rows x 6 columns]